<a href="https://colab.research.google.com/github/rashidov9797/Data_Science_homeworks/blob/main/china_and_korea_pop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("korea_china_population.csv")

In [7]:
df.head()

   years       Korea        China
0   1960  25012374.0  667070000.0
1   1961  25765673.0  660330000.0
2   1962  26513030.0  665770000.0
3   1963  27261747.0  682335000.0
4   1964  27984155.0  698355000.0

In [8]:
df.columns

Index(['years', 'Korea', 'China'], dtype='object')

In [9]:
df.value_counts()

years  Korea       China
2020   51780579.0  1.471287e+09    1
1989   42449038.0  1.118650e+09    1
1987   41621690.0  1.084035e+09    1
1986   41213674.0  1.066790e+09    1
1985   40805744.0  1.051040e+09    1
                                  ..
1995   45092991.0  1.204855e+09    1
1994   44641540.0  1.191835e+09    1
1993   44194628.0  1.178440e+09    1
1992   43747962.0  1.164970e+09    1
1960   25012374.0  6.670700e+08    1
Length: 61, dtype: int64

In [10]:
df.shape

(61, 3)

In [11]:
df['rank'] = df['years'].rank()

In [12]:
df

    years       Korea         China  rank
0    1960  25012374.0  6.670700e+08   1.0
1    1961  25765673.0  6.603300e+08   2.0
2    1962  26513030.0  6.657700e+08   3.0
3    1963  27261747.0  6.823350e+08   4.0
4    1964  27984155.0  6.983550e+08   5.0
..    ...         ...           ...   ...
56   2016  51217803.0  1.445524e+09  57.0
57   2017  51361911.0  1.452625e+09  58.0
58   2018  51606633.0  1.459378e+09  59.0
59   2019  51709098.0  1.465634e+09  60.0
60   2020  51780579.0  1.471287e+09  61.0

[61 rows x 4 columns]

In [20]:
df[df.years==2020]

    years       Korea         China  rank
60   2020  51780579.0  1.471287e+09  61.0

In [22]:
df.sort_values(by='years')

    years       Korea         China  rank
0    1960  25012374.0  6.670700e+08   1.0
1    1961  25765673.0  6.603300e+08   2.0
2    1962  26513030.0  6.657700e+08   3.0
3    1963  27261747.0  6.823350e+08   4.0
4    1964  27984155.0  6.983550e+08   5.0
..    ...         ...           ...   ...
56   2016  51217803.0  1.445524e+09  57.0
57   2017  51361911.0  1.452625e+09  58.0
58   2018  51606633.0  1.459378e+09  59.0
59   2019  51709098.0  1.465634e+09  60.0
60   2020  51780579.0  1.471287e+09  61.0

[61 rows x 4 columns]

In [24]:
df.describe()

             years         Korea         China       rank
count    61.000000  6.100000e+01  6.100000e+01  61.000000
mean   1990.000000  4.142161e+07  1.104911e+09  31.000000
std      17.752934  7.972018e+06  2.492926e+08  17.752934
min    1960.000000  2.501237e+07  6.603300e+08   1.000000
25%    1975.000000  3.528072e+07  9.163950e+08  16.000000
50%    1990.000000  4.286928e+07  1.135185e+09  31.000000
75%    2005.000000  4.818456e+07  1.303720e+09  46.000000
max    2020.000000  5.178058e+07  1.471287e+09  61.000000

In [41]:
chin_df = df[df.columns[2]]
chin_df

0     6.670700e+08
1     6.603300e+08
2     6.657700e+08
3     6.823350e+08
4     6.983550e+08
          ...
56    1.445524e+09
57    1.452625e+09
58    1.459378e+09
59    1.465634e+09
60    1.471287e+09
Name: China, Length: 61, dtype: float64